<a href="https://colab.research.google.com/github/plthiyagu/AI-Engineering/blob/master/03-Pandas/Over_100_Dollars.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

You're given two dataframes: transactions and products.

The transactions dataframe contains transaction ids, product ids, and the total amount of each product sold.

The products dataframe contains product ids and prices.

Write a function to return a dataframe containing every transaction with a total value of over $100. Include the total value of the transaction as a new column in the dataframe.

In [1]:
import pandas as pd

transactions = {"transaction_id" : [1, 2, 3, 4, 5], "product_id" : [101, 102, 103, 104, 105], "amount" : [3, 5, 8, 3, 2]}

products = {"product_id" : [101, 102, 103, 104, 105], "price" : [20.00, 21.00, 15.00, 16.00, 52.00]}

df_transactions = pd.DataFrame(transactions)

df_products = pd.DataFrame(products)

In [2]:
df_transactions

   transaction_id  product_id  amount
0               1         101       3
1               2         102       5
2               3         103       8
3               4         104       3
4               5         105       2

In [3]:
df_products

   product_id  price
0         101   20.0
1         102   21.0
2         103   15.0
3         104   16.0
4         105   52.0

In [5]:
df_merge = pd.merge(df_transactions, df_products, on='product_id')

In [6]:
df_merge

   transaction_id  product_id  amount  price
0               1         101       3   20.0
1               2         102       5   21.0
2               3         103       8   15.0
3               4         104       3   16.0
4               5         105       2   52.0

In [7]:
df_merge['Total'] = df_merge['amount']*df_merge['price']

In [8]:
df_merge.head()

   transaction_id  product_id  amount  price  Total
0               1         101       3   20.0   60.0
1               2         102       5   21.0  105.0
2               3         103       8   15.0  120.0
3               4         104       3   16.0   48.0
4               5         105       2   52.0  104.0

In [9]:
rslt_df = df_merge[df_merge['Total'] > 100]

In [10]:
rslt_df

   transaction_id  product_id  amount  price  Total
1               2         102       5   21.0  105.0
2               3         103       8   15.0  120.0
4               5         105       2   52.0  104.0